In [1]:
import numpy as np
import pandas as pd

In [3]:
data={'company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
      'PERSON':['SAM','ADDI','SWATI','MODI','NAKI','NON'],
      'SALES':[200,120,240,150,130,150]}

In [25]:
df=pd.DataFrame(data)

In [30]:
comp=df.groupby('company')
comp.std()

             SALES
company
FB       14.142136
GOOG     56.568542
MSFT     63.639610

In [31]:
comp.std().loc['FB']

SALES    14.142136
Name: FB, dtype: float64

In [39]:
df.groupby('company').max()

        PERSON  SALES
company
FB         NON    150
GOOG       SAM    200
MSFT     SWATI    240

In [48]:
df.groupby('company').describe()

        SALES
        count   mean        std    min    25%    50%    75%    max
company
FB        2.0  140.0  14.142136  130.0  135.0  140.0  145.0  150.0
GOOG      2.0  160.0  56.568542  120.0  140.0  160.0  180.0  200.0
MSFT      2.0  195.0  63.639610  150.0  172.5  195.0  217.5  240.0

In [49]:
pwd

'C:\\Users\\Bilal Pharmacist'

In [60]:
df=pd.read_excel ('Excel_Sample.xlsx',Sheetname='sheet1')

In [61]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [65]:
df.to_excel('excel_sample.xlsx',sheet_name='sheet2')

In [66]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15